
Процедура ОтправкаУведомленийТелеграм()  Экспорт
	
	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
	   ТекстСообщения = Выборка.ТекстСообщения; 
	   ЕстьСвязь = Истина; 
	   ОтправитьСообщениеВТелеграм(ТекстСообщения, ЕстьСвязь); 
	   Если ЕстьСвязь Тогда  //оправка прошла успешно
  	   	   Выборка.ПолучитьОбъект().Удалить();
 	   КонецЕсли;
    КонецЦикла;  
   
КонецПроцедуры

Процедура ОтправитьСообщениеВТелеграм(ТекстСообщения, ЕстьСвязь)

    //создайте защищённое соединение с сервером "api.telegram.org"
    Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
    
    //подготовьте структуру с полями:
    //"chat_id" - идентификатор группы из константы,    
    //"text" - текст сообщения    
    
    ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); 
       
    //создайте HTTP-запрос к ресурсу /bot[ВашТокен]/sendMessage
    Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 
    
    Ресурс = "bot"+Токен+"/sendMessage?chat_id="+ИдентификаторГруппы+"&text="+ТекстСообщения;

    Запрос = Новый HTTPЗапрос(Ресурс); 
    
    //добавьте заголовок "Content-Type" со значением "application/json"
    Запрос.Заголовки.Вставить("Content-Type", "application/json"); 
    
    //отправьте запрос с помощью метода "POST"
    Ответ = Соединение.Получить(Запрос); 
    
    Если Ответ.КодСостояния <> 200 Тогда
       СтрокаОтвета = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
       ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
              СтрокаОтвета,);  
	   ЕстьСвязь = Ложь; //отправка прошла неуспешно
    КонецЕсли;   
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка", УровеньЖурналаРегистрации.Информация,,,
	           "Сообщение отправлено",);
КонецПроцедуры  

