#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда   
	
	#Область ОбработчикиСобытийМодуляОбъекта
	
	Процедура ОбработкаПроведения(Отказ, Режим)     
		
		Если НЕ ЗначениеЗаполнено(Выплаты) Тогда
			
			Сообщить("Не заполнено ни одной строчки"); 
			Отказ = Истина; 
			
		КонецЕсли;
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками Приход
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
			Движение.Подразделение = ТекСтрокаВыплаты.Подразделение;
			Движение.Сумма = ТекСтрокаВыплаты.Сумма;
		КонецЦикла;
		
	КонецПроцедуры  
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыФункции
	
	Процедура ЗаполнитьЗП() Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
		
		Запрос.УстановитьПараметр("Дата", Дата); 
		
		РезультатЗапроса = Запрос.Выполнить();    
		
		Если РезультатЗапроса.Пустой() Тогда
            
            ОбщегоНазначения.СообщитьПользователю("Всем всё выплачено!"); 
			Возврат; 
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл        
			
			Строка = Выплаты.Добавить();        
			Строка.Сотрудник = Выборка.Сотрудник; 
			Строка.Подразделение = Выборка.Подразделение; 
			Строка.Сумма = Выборка.СуммаОстаток; 
			
		КонецЦикла;
		
	КонецПроцедуры   
	
	#КонецОбласти
	
#КонецЕсли


