
Функция PingGETPing(Запрос)
	
	Возврат ВКМ_Телеграм.ПростойУспешныйОтвет();
	
КонецФункции

Функция SendPOSTSend(Запрос)
	УстановитьПривилегированныйРежим(Истина);
    
    НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени(); 
    
    
	Попытка   
		Ответ = ВКМ_Телеграм.ПростойУспешныйОтвет();
		 
	Исключение   
		ИнформацияОбОшибке = ИнформацияОбОшибке(); 
		Ответ =  ВКМ_Телеграм.ОтветОбОшибке(ИнформацияОбОшибке); 
    КонецПопытки;	
    
    ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send", НачалоЗамера); 
    
    ВКМ_Телеграм.ЗаписьЛога("send", Запрос, Ответ); 
    
	Возврат  Ответ; 
	
КонецФункции
